Repository: rajkumar-natarajan/ExcelCCAT
Catalog: ExcelCCAT/Localization/Localizable_*.strings
Languages: fr

# app_name
source: CCAT Prep TDSB Grade 6
fr: Préparation CCAT TDSB 6e année

# app_subtitle
source: Mock Tests for Gifted – English/French
fr: Simulations pour Surdoués – Anglais/Français

# app_tagline
source: Unlock Your Gifted Potential
fr: Débloquez Votre Potentiel Surdoué

source: English
fr: Anglais

source: Continue
fr: Continuer

source: Start
fr: Démarrer

source: Next
fr: Suivant

source: Previous
fr: Précédent

source: Finish
fr: Terminer

source: Submit
fr: Soumettre

source: Cancel
fr: Annuler

source: Done
fr: Terminé

source: Close
fr: Fermer

source: Save
fr: Enregistrer

source: Reset
fr: Réinitialiser

source: Retry
fr: Réessayer

source: Back
fr: Retour

source: Quantitative
fr: Quantitatif

source: Sentence Completion
fr: Complément de Phrase

source: Number Analogies
fr: Analogies Numériques

source: Quantitative Analogies
fr: Analogies Quantitatives

source: Equation Building
fr: Construction d'Équation

source: Figure Matrices
fr: Matrices de Figures

source: Figure Classification
fr: Classification de Figures

source: Figure Series
fr: Séries de Figures

# full_mock
source: Full Mock Test
fr: Simulation Complète

# practice
source: Practice Mode
fr: Mode Pratique

source: Verbal Only
fr: Verbal Seulement

source: Quantitative Only
fr: Quantitatif Seulement

source: Non-Verbal Only
fr: Non-Verbal Seulement

# difficulty_easy
source: Easy
fr: Facile

# difficulty_medium
source: Medium
fr: Moyen

# difficulty_hard
source: Hard
fr: Difficile

# font_size_small
source: Small
fr: Petit

# font_size_medium
source: Medium
fr: Moyen

# font_size_large
source: Large
fr: Grand

# font_size_extra_large
source: Extra Large
fr: Très Grand

# welcome_message
source: Ready for TDSB's gifted program? Let's go!
fr: Prêt pour le programme surdoués TDSB? Allons-y!

source: Start Full Mock
fr: Démarrer Simulation Complète

source: Practice Mode
fr: Mode Pratique

source: Progress Overview
fr: Aperçu des Progrès

source: Weekly Goal
fr: Objectif Hebdomadaire

source: Current Streak
fr: Série Actuelle

source: Questions This Week
fr: Questions Cette Semaine

source: Best Score
fr: Meilleur Score

source: Average Score
fr: Score Moyen

source: Total Tests
fr: Tests Totaux

# question_number
source: Question %d of %d
fr: Question %d sur %d

source: Time Remaining
fr: Temps Restant

# select_answer
source: Select your answer
fr: Sélectionnez votre réponse

source: Answer selected
fr: Réponse sélectionnée

source: No answer selected
fr: Aucune réponse sélectionnée

# confirm_submit
source: Are you sure you want to submit your test?
fr: Êtes-vous sûr de vouloir soumettre votre test?

# test_auto_submit
source: Test will auto-submit when time expires
fr: Le test sera automatiquement soumis à l'expiration du temps

source: Test Completed!
fr: Test Terminé!

source: Great Job!
fr: Excellent Travail!

source: Your Score
fr: Votre Score

# percentile_rank
source: Percentile Rank: %d%%
fr: Rang Centile: %d%%

source: Gifted Range
fr: Gamme Surdoué

source: Keep Practicing
fr: Continuez à Pratiquer

source: Time Taken: %@
fr: Temps Pris: %@

source: Breakdown by Type
fr: Répartition par Type

# quantitative_score
source: Quantitative: %d/%d
fr: Quantitatif: %d/%d

source: View Detailed Results
fr: Voir Résultats Détaillés

source: Retake Test
fr: Reprendre le Test

source: Practice Weak Areas
fr: Pratiquer les Zones Faibles

# progress_title
source: Your Progress
fr: Vos Progrès

source: Test History
fr: Historique des Tests

source: Practice History
fr: Historique de Pratique

source: Performance Trends
fr: Tendances de Performance

source: Weekly Insights
fr: Aperçus Hebdomadaires

# export_progress
source: Export Progress Report
fr: Exporter Rapport de Progrès

source: Filter by Date
fr: Filtrer par Date

source: Filter by Type
fr: Filtrer par Type

source: Sort by Date
fr: Trier par Date

source: Sort by Score
fr: Trier par Score

# practice_title
source: Practice Mode
fr: Mode Pratique

# confirm_reset_progress_message
source: This will delete all your test results and progress. This cannot be undone.
fr: Ceci effacera tous les progrès. Cette action est irréversible.

# low_battery_warning
source: Low Battery
fr: Batterie Faible

# low_battery_message
source: Your device battery is low. Consider charging before continuing.
fr: Batterie sous 20%. Branchez l'appareil pour éviter une interruption.

source: Time Warning
fr: Alerte Temps

source: Time Critical
fr: Temps Critique

# less_than_minute
source: Less than 1 minute remaining!
fr: Moins d'une minute restante!

source: minutes remaining
fr: minutes restantes

source: Select Question Type
fr: Sélectionner Type de Question

source: Select Difficulty
fr: Sélectionner Difficulté

source: Number of Questions
fr: Nombre de Questions

source: Timed Practice
fr: Pratique Chronométrée

source: Untimed Practice
fr: Pratique Non Chronométrée

source: Immediate Feedback
fr: Retour Immédiat

source: Review at End
fr: Révision à la Fin

source: Custom Practice
fr: Pratique Personnalisée

# settings_title
source: Settings
fr: Paramètres

# language_settings
source: Language
fr: Langue

source: Appearance
fr: Apparence

source: Dark Mode
fr: Mode Sombre

source: Font Size
fr: Taille de Police

source: Accessibility
fr: Accessibilité

source: Reduce Motion
fr: Réduire le Mouvement

source: Haptic Feedback
fr: Retour Haptique

source: Sound Effects
fr: Effets Sonores

source: Timer Warnings
fr: Avertissements de Minuterie

# auto_submit
source: Auto Submit on Timeout
fr: Soumission Automatique à l'Expiration

source: Parental Controls
fr: Contrôles Parentaux

source: Progress Reports
fr: Rapports de Progrès

source: Data Management
fr: Gestion des Données

source: Export Data
fr: Exporter les Données

source: Import Data
fr: Importer les Données

source: Reset Progress
fr: Réinitialiser les Progrès

source: About
fr: À Propos

source: Privacy Policy
fr: Politique de Confidentialité

source: Contact Support
fr: Contacter le Support

source: Strength: Verbal
fr: Force: Verbal

source: Strength: Quantitative
fr: Force: Quantitatif

source: Strength: Non-Verbal
fr: Force: Non-Verbal

source: Focus on patterns
fr: Concentrez-vous sur les motifs

source: Practice more analogies
fr: Pratiquez plus d'analogies

source: Work on time management
fr: Travaillez sur la gestion du temps

source: Excellent progress!
fr: Excellent progrès!

source: Good improvement
fr: Bonne amélioration

# keep_up_good_work
source: Keep up the good work
fr: Continuez le bon travail

source: Consistency is key
fr: La consistance est la clé

# quantitative_improved
source: Quantitative +%d%% - great!
fr: Quantitatif +%d%% - formidable!

# non_verbal_improved
source: Non-Verbal +%d%% - awesome!
fr: Non-Verbal +%d%% - fantastique!

# error_title
source: Error
fr: Erreur

source: Error loading questions
fr: Erreur lors du chargement des questions

source: Error saving progress
fr: Erreur lors de la sauvegarde des progrès

# error_network
source: Network error
fr: Erreur de réseau

# error_generic
source: Something went wrong
fr: Quelque chose s'est mal passé

source: Try Again
fr: Réessayer

# contact_support_error
source: Please contact support if this persists
fr: Veuillez contacter le support si cela persiste

source: Achievement Unlocked!
fr: Réalisation Débloquée!

source: First Test Completed
fr: Premier Test Terminé

source: Perfect Score
fr: Score Parfait

# streak_5_days
source: 5-Day Streak
fr: Série de 5 Jours

# streak_10_days
source: 10-Day Streak
fr: Série de 10 Jours

# streak_30_days
source: 30-Day Streak
fr: Série de 30 Jours

# hundred_questions
source: 100 Questions Answered
fr: 100 Questions Répondues

# five_hundred_questions
source: 500 Questions Answered
fr: 500 Questions Répondues

source: Gifted Range Achieved
fr: Gamme Surdoué Atteinte

source: Improvement Master
fr: Maître de l'Amélioration

source: Consistency Champion
fr: Champion de la Consistance

# accessibility_selected
source: Selected
fr: Sélectionné

# accessibility_correct_answer
source: Correct answer
fr: Bonne réponse

# accessibility_incorrect_answer
source: Incorrect answer
fr: Mauvaise réponse

# accessibility_timer
source: Timer: %@ remaining
fr: Minuterie: %@ restant

# accessibility_progress
source: Progress: %d of %d questions completed
fr: Progrès: %d de %d questions terminées

# accessibility_score_ring
source: Score: %d percent
fr: Score: %d pourcent

# confirm_exit_test
source: Exit Test
fr: Quitter le Test

# confirm_exit_test_message
source: Are you sure you want to exit? Your progress will be lost.
fr: Êtes-vous sûr de vouloir quitter? Vos progrès seront perdus.

# confirm_reset_progress
source: Reset Progress
fr: Réinitialiser les Progrès

# confirm_language_change
source: Change Language
fr: Changer de Langue

# confirm_language_change_message
source: Changing language will restart the current session. Continue?
fr: Changer de langue redémarrera la session actuelle. Continuer?

source: seconds
fr: secondes

source: hours
fr: heures

source: days
fr: jours

source: weeks
fr: semaines

source: Accuracy
fr: Précision

source: Total Time Spent
fr: Temps Total Passé

source: Average Time per Question
fr: Temps Moyen par Question

source: Strongest Area
fr: Zone la Plus Forte

# improvement_area
source: Area for Improvement
fr: Zone d'Amélioration

source: Recommendation
fr: Recommandation

# welcome_title
source: Welcome to CCAT Prep
fr: Bienvenue dans Préparation CCAT

# welcome_subtitle
source: Your path to gifted program success
fr: Votre chemin vers le succès du programme surdoué

# onboarding_features
source: Features
fr: Fonctionnalités

# onboarding_practice
source: Practice with real CCAT questions
fr: Pratiquez avec de vraies questions CCAT

# onboarding_mock_tests
source: Take full mock tests
fr: Passez des tests de simulation complets

# onboarding_progress
source: Track your progress
fr: Suivez vos progrès

# onboarding_bilingual
source: Available in English and French
fr: Disponible en anglais et français

source: Get Started
fr: Commencer

source: Skip Intro
fr: Passer l'Introduction

source: Review Mode
fr: Mode Révision

# review_question
source: Review Question %d
fr: Réviser Question %d

source: Your Answer
fr: Votre Réponse

source: Correct Answer
fr: Bonne Réponse

source: Explanation
fr: Explication

source: Show Explanation
fr: Montrer l'Explication

source: Hide Explanation
fr: Cacher l'Explication

source: Marked for Review
fr: Marqué pour Révision

source: Review Summary
fr: Résumé de Révision

source: Questions Correct
fr: Questions Correctes

source: Questions Incorrect
fr: Questions Incorrectes

source: Questions Skipped
fr: Questions Sautées

source: Review Weak Areas
fr: Réviser les Zones Faibles

source: Performance Analysis
fr: Analyse de Performance

# review_description
source: Identify areas that need improvement based on your test history
fr: Identifier les domaines à améliorer basé sur votre historique de tests

# analyzing_performance
source: Analyzing your performance...
fr: Analyse de votre performance...

# no_test_data
source: No Test Data Available
fr: Aucune Donnée de Test Disponible

# take_tests_first
source: Complete some practice sessions or mock tests to see your weak areas
fr: Complétez quelques sessions de pratique ou tests simulés pour voir vos zones faibles

source: Start Practicing
fr: Commencer à Pratiquer

source: Areas to Improve
fr: Domaines à Améliorer

source: Recommendations
fr: Recommandations

source: Critical
fr: Critique

source: Moderate
fr: Modéré

source: Minor
fr: Mineur

source: Focused Practice
fr: Pratique Ciblée

source: Targeted Practice
fr: Pratique Ciblée

source: Session Settings
fr: Paramètres de Session

source: Question Count
fr: Nombre de Questions

source: Timed Session
fr: Session Chronométrée

source: Start Focused Practice
fr: Commencer la Pratique Ciblée

# verbal_weakness_desc
source: Difficulty with word relationships and language comprehension
fr: Difficulté avec les relations de mots et la compréhension du langage

# quantitative_weakness_desc
source: Challenges with mathematical reasoning and number patterns
fr: Défis avec le raisonnement mathématique et les motifs numériques

# nonverbal_weakness_desc
source: Struggles with visual patterns and spatial reasoning
fr: Difficultés avec les motifs visuels et le raisonnement spatial

# analogies_weakness_desc
source: Trouble identifying relationships between words and concepts
fr: Difficulté à identifier les relations entre mots et concepts

# sentence_completion_weakness_desc
source: Difficulty understanding context and vocabulary
fr: Difficulté à comprendre le contexte et le vocabulaire

# classification_weakness_desc
source: Challenges grouping items by common characteristics
fr: Défis pour regrouper les éléments par caractéristiques communes

# number_analogies_weakness_desc
source: Trouble with mathematical relationships and patterns
fr: Difficulté avec les relations mathématiques et les motifs

# quantitative_analogies_weakness_desc
source: Difficulty with formula and equation patterns
fr: Difficulté avec les motifs de formules et d'équations

# equation_building_weakness_desc
source: Challenges solving mathematical problems step by step
fr: Défis pour résoudre les problèmes mathématiques étape par étape

# general_weakness_desc
source: This area needs focused practice and improvement
fr: Ce domaine nécessite une pratique ciblée et une amélioration

# easy_difficulty_weakness_desc
source: Basic concepts need strengthening
fr: Les concepts de base ont besoin de renforcement

# medium_difficulty_weakness_desc
source: Intermediate skills require development
fr: Les compétences intermédiaires nécessitent un développement

# hard_difficulty_weakness_desc
source: Advanced problem-solving needs improvement
fr: La résolution de problèmes avancés nécessite une amélioration

source: Difficulty Questions
fr: Questions de Difficulté

source: Improve Vocabulary
fr: Améliorer le Vocabulaire

# vocabulary_tip
source: Focus on word relationships and analogies
fr: Concentrez-vous sur les relations de mots et les analogies

source: Practice Verbal
fr: Pratiquer Verbal

# strengthen_math
source: Strengthen Math Skills
fr: Renforcer les Compétences Mathématiques

# math_tip
source: Practice number patterns and equations
fr: Pratiquez les motifs numériques et les équations

source: Practice Quantitative
fr: Pratiquer Quantitatif

source: Enhance Visual Reasoning
fr: Améliorer le Raisonnement Visuel

# visual_tip
source: Focus on pattern recognition and spatial relationships
fr: Concentrez-vous sur la reconnaissance de motifs et les relations spatiales

source: Practice Non-Verbal
fr: Pratiquer Non-Verbal

# take_mock_test
source: Take a Full Mock Test
fr: Passer un Test Simulé Complet

# mock_test_tip
source: Get a complete assessment of your abilities
fr: Obtenez une évaluation complète de vos capacités

source: Start Mock Test
fr: Commencer le Test Simulé

source: Easy
fr: Facile

source: Medium
fr: Moyen

source: Hard
fr: Difficile
